package com.first.myapplicationtry;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.widget.TextView;

public class Rules extends AppCompatActivity {

    private TextView part1;
    private TextView part2;
    private TextView part3;
    private TextView part4;
    private TextView part5;
    private TextView part6;
    private TextView part7;
    private TextView part8;
    private TextView part9;
    private TextView part10;
    private TextView part11;
    private TextView part12;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_rules);

        part1 = findViewById(R.id.part1_description);
        part2 = findViewById(R.id.part2_description);
        part3 = findViewById(R.id.part3_description);
        part4 = findViewById(R.id.part4_description);
        part5 = findViewById(R.id.part5_description);
        part6 = findViewById(R.id.part6_description);
        part7 = findViewById(R.id.part7_description);
        part8 = findViewById(R.id.part8_description);
        part9 = findViewById(R.id.part9_description);
        part10 = findViewById(R.id.part10_description);
        part11 = findViewById(R.id.part11_description);
        part12 = findViewById(R.id.part12_description);



        //כללי
        {
            part1.setText("1.\tברוכים הבאים לאפליקציית שליקה.\n" +
                    "2.\tהאפליקציה הינה בבעלות של דרכים יועצים – מיטל ברק וכל שימוש בה על ידך כפוף להוראות תנאי השימוש להלן.\n" +
                    "3.\tבהעדר הסכמה לאילו מהתנאים הכלולים בתנאי שימוש אלו, עליך להימנע מלעשות כל שימוש באפליקציה.\n" +
                    "4.\tבבחירתך לעשות שימוש כלשהו באפליקציה הנך להסכים לתנאי שימוש אלו במלואם.\n" +
                    "5.\tהבעלים שומרים לעצמם את הזכות לשנות תנאי שימוש אלו, והנך להסכים בזאת כי בכל שימוש שלך באפליקציה לאחר המועד שבו תנאים אלו השתנו עליך לקבל על עצמך את הגרסה המעודכנת.\n" +
                    "6.\tתנאי שימוש אלו חלים על האפליקציה ו/או חלקים ממנה ועל השימוש בה ובתכנים הכלולים בה, לרבות על עיצובים, קוד מקור, מודולי תוכנה ותכנים ו/או מוצרים ו/או שירותים כלשהם של האפליקציה ו/או שהאפליקציה מאפשרת נגישות ו/או הורדה שלהם, והם מהווים חלק בלתי נפרד מהם ומתפקוד האפליקציה ו/או משירותים המוצעים בה ו/או באמצעותה, בתמורה או שלא בתמורה )להלן, ביחד ולחוד: \"השירותים\"(.\n" +
                    "7.\tהשימוש במידע, במוצרים ו/או בשירותים כלשהם באמצעות האפליקציה ובכלל הינם באחריותך הבלעדית ובכפוף להוראות תנאי שימוש אלו.\n" +
                    "8.\tהנך להסכים בזאת במפורש כי הבעלים פטורים לחלוטין מכל אחריות, נזק או אי נוחות, לך או לאחרים, לגבי כל היבט של שימוש באפליקציה/במוצרים/בשירותים באמצעות האפליקציה או שיסופקו לך באמצעותה והנך לקחת את כל האחריות לכך על עצמך בלבד ולבצע את כל הבדיקות הדרושות.\n");
        }

        //תנאי שימוש
        {
            part2.setText("1.\tתנאי שימוש אלו נועדו להבהיר מה הם התנאים החלים על כל מי שעשה, עושה ו/או יעשה שימוש באפליקציה.\n" +
                    "2.\tבתנאי שימוש אלו, הביטוי \"תוכן\" כולל כל שירות, מוצר, קוד מקור, מודול תוכנה, יישום תוכנה, טקסט, תצלום, תמונה, עיצוב, איור, מפה, קטע צליל, קטע וידיאו, גרפיקה, ביטוי, יצירה, ידע או מידע אחר, בשלמותם ו/או בחלקם, המוצגים באפליקציה זו ו/או שימשו לתכנונה/אפיונה ו/או המוזנים אליה ו/או הכלולים בה ו/או הממוענים אליה/ממנה, וזאת בכל אמצעי תקשורת ו/או קשר, בין בתשלום ובין בלא תשלום, על ידך ו/או צד שלישי כלשהו, וכן כל זכות קניין רוחני, לרבות, אך לא רק, פטנטים, סימני מסחר זכויות יוצרים וזכויות מוסרית, המתייחסות לאלו מהם.\n" +
                    "3.\tכל שימוש שייעשה בתנאי שימוש אלו בלשון זכר או בלשון נקבה הינו לצרכי נוחות בלבד, והפנייה היא לנשים ולגברים כאחד. כמו-כן, כל פניה ליחיד משמעה גם פנייה לרבים ולהפך.\n");
        }

        //גישה לאפליקציה
        {
            part3.setText("1.\tהבעלים שומרים לעצמם את הזכות לאפשר או לא לאפשר שימוש באפליקציה בכל עת, וכן לשנות ו/או להפסיק לעשות כן, והכל לפי שיקול דעתם הבלעדי.\n" +
                    "2.\tיכול שהגישה לאפליקציה או חלקה, והאפשרות לבצע פעולות מסוימות, תתאפשר למשתמשים מסוימים אך תהא מוגבלת למשתמשים אחרים, מסיבות כאלה ואחרות, או לא תתאפשר כלל ו/או תהא כרוכה בהקצאת שם משתמש ו/או סיסמה ו/או תהא מותנית במילוי שאלון ו/או מסירת פרטים אישיים, הכל לפי שיקול דעתם המוחלט והבלעדי של הבעלים.\n" +
                    "3.\tהבעלים יוכלו להתחיל לדרוש זאת ללא הודעה מוקדמת, או להוסיף לדרוש זאת, או להפסיק לדרוש זאת, או לעשות כן מדי פעם בפעם, ללא הודעה מוקדמת, ולפי שיקול דעתם המוחלט והבלעדי.\n");

        }

        //שימוש במידע שמסרת
        {
            part4.setText("1.\tע\"י השימוש באפליקציה הנך להסכים בזאת לאיסוף והתחקות אחר נתונים, מידע, תוכן, פעולות והרגלי שימוש שלך ואלו ישמשו לצרכים שונים, לרבות מסחריים ושיווקיים.\n" +
                    "2.\tאם מסרת כתובת דואל או מספר טלפון הנך מסכים בזאת לקבל הודעות לכתובת דואל אותה מסרת לצרכים שונים, ובכלל זה פרסומות, הזמנות, הצעות הודעות ומסרים מסחריים מכל סוג. הנך רשאי לבקש להפסיק שיגור של הודעות כאמור בהתאם להוראות כל דין.\n");
        }

        //סוג התכנים באפליקציה
        {
            part5.setText("1.\tהבעלים שומרים לעצמם את הזכות לבחור האם ואלו תכנים יופיעו ו/או יפורסמו, או יפסיקו/יוסיפו להופיע ו/או להתפרסם באפליקציה, או יופיעו/יתפרסמו מדי פעם בפעם, הכל לפי שיקול דעתם הבלעדי והמוחלט, ולפי צרכיהם המסחריים, וללא הודעה מראש או עדכון בדיעבד.\n" +
                    "2.\tהבעלים עשויים לשנות, להוסיף, לגרוע, למחוק ולעדכן מעת לעת את תכני האפליקציה ו/או מראה האפליקציה ו/או אופן הפעלתה ו/או אופן השימוש בה ו/או מוצרים ו/או שירותים הכלולים בה, ללא הודעה מוקדמת ולפי שיקול דעתם הבלעדי.\n" +
                    "3.\tהבעלים שומרים לעצמם את הזכות לכלול באפליקציה תכנים המהווים פרסומות שלהם ו/או של אחרים ו/או תכנים מסחריים אחרים כלשהם )להלן: \"פרסומות\"(.\n" +
                    "4.\tתמונות, אילוסטרציות והדמיות המופיעות באפליקציה הינן להמחשה בלבד, ואינן מחייבות את הבעלים.\n" +
                    "5.\tהפרסומות שיופיעו באפליקציה ו/או שיישלחו למשתמשים בה, הינן באחריות המלאה והבלעדית של המפרסמים.\n");
        }

        //זמינות תכנים לאפליקציה
        {
            part6.setText("1.\tהנך לאשר כי יתכנו תקלות כאלה ואחרות, הנובעות מסיבות כאלה ואחרות, העלולות למנוע את הגישה ו/או השימוש באפליקציה, או להכביד עליהם, לרבות עקב קשיי תקשורת ו/או לשם תחזוקה ו/או מטעמים אחרים, ויכול שהשימוש באפליקציה ייקטע ו/או יופסק ללא השלמה ו/או שמירה. הבעלים יהיו פטורים מכל אחריות לכך, ועליך לשמור מראש כל מידע שבדעתך לעשות בו שימוש או להזין לאפליקציה, בטרם עשותך כן.");
        }


        // הזנת תכנים לאפליקציה
        {
            part7.setText("1.\tאם במסגרת שימוש באפליקציה, חיפוש, הזמנת מוצרים ו/או שירותים ו/או פעילות אחרת באמצעות האפליקציה, האפליקציה תאפשר לך להזין מידע ו/או תכנים כלשהם, האחריות על תכנים אלו, משמעותם ועצם הזנתם תחול עליך בלבד.\n" +
                    "2.\tמבלי לגרוע מהאמור לעיל, אין להזין לאפליקציה ו/או להפיץ ממנה ו/או באמצעותה תוכן כלשהו שעלול לפגוע באדם כלשהו, שמו הטוב, פרטיותו, קנייניו או זכויותיו, ואין להזין תכנים לאפליקציה בניגוד להוראות תנאי שימוש אלו ו/או הוראות כל דין.\n" +
                    "3.\tהבעלים שומרים לעצמם את הזכות, לערוך, לשנות ואף למחוק תכנים כאלו. הנך לתת בזאת את הסכמתך המפורשת לעריכת שינויי תוכן ו/או עריכה ו/או מחיקה של תכנים כלשהם שהוזנה לאפליקציה.\n" +
                    "4.\tהאחריות לכל מעשה או מחדל שאינם עולים בקנה אחד עם האמור לעיל הינה עליך בלבד.\n");
        }

        //זכויות בעלות וזכויות קניין
        {
            part8.setText("1.\tאפליקציה זו ותכניה הם הרכוש הבלעדי של בעלי זכויות הקניין בהם, ואינם רכושך, ואין לעשות בהם כל שימוש אלא בכפוף לתנאי שימוש אלו.\n" +
                    "2.\tהבעלים שומרים לעצמם את הזכות לאכוף, להסיר, לשנות, לתקן, ולמנוע כל שימוש ו/או הזנה לאפליקציה ו/או פרסום של תכנים המפרים זכויות קניין רוחני שלהם ו/או של צדדים שלישיים, ולדרוש כל פיצוי ו/או שיפוי מכל מי שעלול להעמיד את עצמו ו/או את הבעלים במצב של הפרה אפשרית של זכויותיהם ו/או של אחרים.\n");
        }

        //שימוש בתכני האפליקציה
        {
            part9.setText("1.\tכל שימוש באפליקציה ו/או בתכנים כלשהם הכלולים בה ו/או נלקחו ממנה, הינם לשימוש אישי בלבד, ואין לעשות כל שימוש אחר לרבות עסקי, שיווקי או מסחרי, אלא אם יותר לעשות כן ע\"י הבעלים במפורש, מראש ובהיתר בכתב, ובהתאם לתנאי ההיתר, כאמור בגוף האפליקציה.\n" +
                    "2.\tבכלל זה, ומבלי לגרוע מכלליות האמור לעיל, אין לנצל איזו מזכויות הקניין הרוחני של הבעלים ו/או צד שלישי ללא הסכמתם, לרבות, אך לא רק, בדרך של גזירה, העתקה, שמירה כקובץ, שכפול, הפצה, עיבוד, מחיקה, תוספת, שינוי, מכירה, השכרה, השאלה, מסירה, הצגה פומבית, ביצוע פומבי, יצירת יצירה ניגזרת, או כל דרך אחרת.\n");
        }

        //פטור מאחריות
        {
            part10.setText("1.\tהאפליקציה והתכנים הכלולים בה, מוצגים ומוצעים לשימוש במצבם כפי שהוא )\"Is As.\n" +
                    "2.\tהבעלים לא יישאו באחריות כלשהי, חוזית ו/או נזיקית ו/או אחרת, לשימוש כלשהו שייעשה באפליקציה ו/או בישומייה, ו/או למניעה ו/או להפרעה משימוש באפליקציה מסיבה כלשהי.\n" +
                    "3.\tהבעלים לא יישאו באחריות כלשהי לתכנים שיימסרו או יוזנו על ידך, חוקיותם, אמינותם, מהימנותם, דיוקם, שלמותם, קבצי מחשב שיצורפו אליהם, ולכל נזק, הפסד, עגמת נפש או תוצאות, במישרין או בעקיפין, לך ו/או לצד שלישי כלשהו.\n" +
                    "4.\tהבעלים לא יישאו בכל אחריות לכל נזק עקב הורדת האפליקציה ו/או נזק שנבע מקישור הכלול באפליקציה ולכל נזק שנבע מהצגה או מפרסום של תכנים כאמור בכל דרך אחרת. כמו כן, אחריות המלאה והבלעדית לכל קישור, הצגה או פרסום של התכנים שנעשו על ידך הנם עליך והנך להתחייב בזאת לשפות את הבעלים בגין כל נזק שייגרם כתוצאה מכך.\n");
        }

        //שיפוי
        {
            part11.setText("1.\tהנך להתחייב לשפות ולפצות את הבעלים ו/או כל מי מטעמם, בגין כל מעשה ו/או מחדל שגרם לבעלים נזק ישיר או עקיף, הפסד, אבדן-רווח, תשלום או הוצאה, בין עקב הפרת תנאי שימוש אלו, בין עקב הפרת הוראות כל דין, ובין עקב כל טענה או תביעה מצד שלישי כלשהו.");
        }

        //שינויים בתנאי שימוש
        {
            part12.setText("יכול שבהוראות תנאי שימוש אלו יחולו מעת לעת שינויים, עדכונים, תוספות, מחיקות, לפי שיקול דעתם המוחלט והבלעדי של הבעלים, עליהם תפורסם הודעה. אם הינך מעוניין להמשיך לעשות שימוש באפליקציה זו, ייראו אותך כמסכים לתנאים המתוקנים, אלא אם הם יעמדו בסתירה להוראות החוק.");
        }


    }
}
